<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the current release version of LibreOffice. Set RELEASE to either "fresh" or "still".

LibreOffice Still is the stable version that has undergone more testing (over a longer time). It is usually recommended for more conservative use.
LibreOffice Fresh is the stable version with the most recent features. Users interested in taking advantage of our most innovative features should download and use our fresh version.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.install.LibreOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOffice</string>
		<key>RELEASE</key>
		<string>fresh</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.LibreOffice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>source_item</key>
						<string>LibreOffice.app</string>
						<key>destination_path</key>
						<string>/Applications/</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
