<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads, packages and installs the current release version of Joplin.

The architecture (ARCH) can be 'x86_64' or 'arm64'</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.install.Joplin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Joplin</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.Joplin</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
