<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of ATLAS.ti.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.AutotaskWorkplace</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AutotaskWorkplace</string>
		<key>DOWNLOAD_URL</key>
		<string>https://us.awp.autotask.net/update/AutotaskWorkplace.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>CHECK_FILESIZE_ONLY</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Autotask Workplace Desktop.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.autotask.awp" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = RJ45JTLWF6)</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
