<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the current release version of ELAN. This recipe downloads the Intel version by default. To get the Apple Silicon version, set ARCH variable to "M1"</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.install.ELAN</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.ELAN</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
