<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of CheatSheet and builds a package.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.pkg.CheatSheet</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CheatSheet</string>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.CheatSheet</string>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>