<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Kaleidoscope and imports into Munki.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.Kaleidoscope</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kaleidoscope</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>dev</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Easily spot the differences in text and image files. Review changes in seconds with the world's most advanced Mac diff tool.</string>
			<key>developer</key>
			<string>Leitmotif GmbH</string>
			<key>display_name</key>
			<string>Kaleidoscope</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Install ksdiff command line tool.
[[ $3 == "/" ]] || exit 1
KS_APP="/Applications/Kaleidoscope.app"
KS_BIN_DIR="$KS_APP/Contents/Resources/bin"
INSTALL_DIR="/usr/local/bin"
"$KS_APP/Contents/Resources/Integration/scripts/install_ksdiff" "$KS_BIN_DIR" "$INSTALL_DIR"
exit 0
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.Kaleidoscope</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
