<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of 1Password.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.1Password</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>1Password</string>
		<key>PREFERRED_SOURCE</key>
		<string>Amazon CloudFront</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>OnePasswordURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%PREFERRED_SOURCE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
