<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of ATLAS.ti.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.ATLAS.ti</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ATLAS.ti</string>
		<key>DOWNLOAD_URL</key>
		<string>http://update.atlasti.com/spk/mac/latest/ATLAS.ti.dmg</string>
		<!--
		<key>SPARKLE_FEED_URL</key>
		<string>http://update.atlasti.com/spk/mac/atlasti-mac-beta-updates.xml</string>
		-->
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<!--
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		-->
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/ATLAS.ti.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.atlasti.ATLAS-ti" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5B3ZVQ9HJ3")</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
