<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of AppCode.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.AppCode</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AppCode</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>URLTextSearcher</string>
	        <key>Arguments</key>
	        <dict>
	            <key>url</key>
	            <string>http://www.jetbrains.com/objc/download/download_thanks.jsp?os=mac</string>
	            <key>re_pattern</key>
	            <!-- http://download.jetbrains.com/objc/AppCode-2.5.5.dmg -->
                <string>(http://.*/AppCode-[0-9\.]+\.dmg)</string>
                <key>result_output_var_name</key>
                <string>url</string>
	        </dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/AppCode.app</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Application: JetBrains s.r.o.</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
