<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of PyCharm Edu and imports into Munki.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.PyCharmEdu</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PyCharmEdu</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JetBrains</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Free, easy and professional tool to learn programming with Python. PyCharm Edu is designed to help programmers with little or no previous coding experience to learn programming quickly and efficiently, by using a modern professional tool.</string>
			<key>developer</key>
			<string>JetBrains s.r.o.</string>
			<key>display_name</key>
			<string>PyCharm Edu</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.PyCharmEdu</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>PyCharm Edu.app</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
