<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of younited and imports into Munki.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.younited</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>younited</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/F-Secure</string>
		<key>MUNKI_CATEGORY</key>
		<string>File Sharing</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>With younited, you'll always have your stuff with you. Your music, movies and photos, younited on your mobile phone, computer or tablet.</string>
			<key>developer</key>
			<string>F-Secure</string>
			<key>display_name</key>
			<string>younited</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.younited</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>younited.app</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
