<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest defined Elastic Beat product. Use an override to set OPTIONAL_VERSION to -oss to download the Apache 2.0 licensed version of the Beat. Set BEAT_NAME to one of the following: filebeat, packetbeat, metricbeat, heartbeat, auditbeat, functionbeat. Note: winlogbeat and journalbeat do not have macOS binaries and functionbeat does not have an Apache 2.0 licensed version.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.elasticbeat</string>
	<key>Input</key>
	<dict>
		<key>BEAT_NAME</key>
		<string>filebeat</string>
		<key>NAME</key>
		<string>filebeat</string>
		<key>OPTIONAL_VERSION</key>
		<string></string>
		<key>PREFERRED_MAJOR_VERSION</key>
		<string></string>
		<!-- ARCH can be either aarch64 or x86_64 -->
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.elastic.co/downloads/beats/%BEAT_NAME%%OPTIONAL_VERSION%</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://artifacts.elastic.co/downloads/beats/%BEAT_NAME%/%BEAT_NAME%%OPTIONAL_VERSION%-(?P&lt;version&gt;%PREFERRED_MAJOR_VERSION%[\d\.]+)-darwin-%ARCH%\.tar\.gz)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%BEAT_NAME%-%version%-darwin-%ARCH%.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://artifacts.elastic.co/downloads/beats/%BEAT_NAME%/%BEAT_NAME%%OPTIONAL_VERSION%-%version%-darwin-%ARCH%.tar.gz.sha512</string>
				<key>re_pattern</key>
				<string>(?P&lt;checksum&gt;\w+)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>SHA512</string>
				<key>checksum</key>
				<string>%checksum%</string>
				<key>checksum_pathname</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%BEAT_NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%BEAT_NAME%/%BEAT_NAME%-%version%-darwin-%ARCH%/%BEAT_NAME%</string>
				<key>requirement</key>
				<string>identifier %BEAT_NAME% and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2BT3HPN62Z"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
