<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Elasticsearch Filebeat</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Filebeat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Filebeat</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.elastic.co/downloads/beats/filebeat</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://download.elastic.co/beats/filebeat/filebeat-(?P&lt;version&gt;[\d\.]+)+-darwin.tgz)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-darwin.tgz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.elastic.co/beats/filebeat/filebeat-%version%-darwin.tgz.sha1.txt</string>
				<key>re_pattern</key>
				<string>(?P&lt;checksum&gt;\w+)\s+filebeat-%version%-darwin.tgz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>algorithm</key>
				<string>SHA1</string>
				<key>checksum</key>
				<string>%checksum%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
