<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Elastic metricbeat, creates a package and imports into Munki</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.metricbeat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>metricbeat</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/metricbeat</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Elasticsearch</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Ship and analyze metrics.</string>
			<key>developer</key>
			<string>Elasticsearch</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.metricbeat</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
