<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of MPlayerX and imports into Munki.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.MPlayerX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MPlayerX</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>MUNKI_CATEGORY</key>
		<string>Media Players</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>MPlayerX provides you a super easy way to enjoy your favorite multimedia collection, without losing any functionalities.</string>
			<key>developer</key>
			<string>Zongyao Qu</string>
			<key>display_name</key>
			<string>MPlayerX</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				 <key>warning_message</key>
				 <string>This recipe has been deprecated and will be removed soon</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
