<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest TeXstudio.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.TeXstudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeXstudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>First determine the latest version</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://sourceforge.net/projects/texstudio/rss?limit=10</string>
				<key>re_pattern</key>
				<string>https://sourceforge.net/projects/texstudio/files/(?P&lt;version&gt;[0-9\.]+)/texstudio[_-][0-9\.]+[_-]osx\.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Now use the latest version to request links to a specific language</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<!--    https://sourceforge.net/projects/texstudio/rss?path=/texstudio/TeXstudio%202.10.4 -->
				<string>https://sourceforge.net/projects/texstudio/rss?path=/%version%</string>
				<key>re_pattern</key>
				<!-- https://sourceforge.net/projects/texstudio/files/texstudio/TeXstudio%202.10.4/texstudio-2.10.4-osx-qt5.5.1.zip/download -->
				<string>(?P&lt;url&gt;https://.*/%version%/texstudio[_\-]%version%[_\-]osx\.dmg/download)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>CHECK_FILESIZE_ONLY</key>
				<true />
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	    <dict>
	               <key>Processor</key>
	               <string>AppDmgVersioner</string>
	               <key>Arguments</key>
	               <dict>
					   <key>dmg_path</key>
					   <string>%pathname%</string>
	                   <key>input_path</key>
	                   <string>%pathname%/texstudio.app</string>
	              
	               </dict>
			   </dict>
	</array>
</dict>
</plist>

