<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads, packages and installs the latest version of GitUp. Set RELEASE_CHANNEL to "stable" or "continuous".</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.install.GitUp</string>
	<key>Input</key>
	<dict>
		<key>RELEASE_CHANNEL</key>
		<string>stable</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.GitUp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
