<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Workspace ONE Intelligent Hub (previously AirWatch Agent) release.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.WorkspaceONEIntelligentHub</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WorkspaceONEIntelligentHub</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<!-- https://www.getwsone.com/ -->
				<key>url</key>
				<string>https://packages.omnissa.com/wsone/WorkspaceONEIntelligentHubRebranded.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Wandering WiFi LLC (S2ZMFGQM93)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
