<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest iLok License Manager disk image.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.iLokLicenseManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iLokLicenseManager</string>
		<key>DOWNLOAD_URL</key>
		<string>http://installers.ilok.com/iloklicensemanager/LicenseSupportInstallerMac.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
