<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Big Sur Blocker and builds a package.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.pkg.BigSurBlocker</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BigSurBlocker</string>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.BigSurBlocker</string>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
