<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ExifTool.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.ExifTool</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ExifTool</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>URLTextSearcher</string>
	        <key>Arguments</key>
	        <dict>
	            <key>url</key>
	            <string>http://owl.phy.queensu.ca/~phil/exiftool/</string>
	            <key>re_pattern</key>
                <string>(ExifTool-[0-9\.]+\.dmg)</string>
                <key>result_output_var_name</key>
                <string>dmg</string>
	        </dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
			    <key>url</key>
                <string>http://owl.phy.queensu.ca/~phil/exiftool/%dmg%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
