<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current release version of Atom, and makes a package.</string>
    <key>Identifier</key>
    <string>io.github.hjuutilainen.pkg.Atom</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Atom</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>io.github.hjuutilainen.download.Atom</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-pkg</string>
          <key>pkgdirs</key>
          <dict>
            <key>Applications</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%pkgroot%/Applications/</string>
          <key>source_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PlistReader</string>
        <key>Arguments</key>
        <dict>
          <key>info_path</key>
          <string>%pkgroot%/Applications/Atom.app</string>
          <key>plist_keys</key>
          <dict>
            <key>CFBundleShortVersionString</key>
            <string>version</string>
            <key>CFBundleIdentifier</key>
            <string>bundleid</string>
            <key>CFBundleName</key>
            <string>app_name</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkgname</key>
          <string>%NAME%-%version%</string>
          <key>pkg_request</key>
          <dict>
            <key>pkgdir</key>
            <string>%RECIPE_CACHE_DIR%</string>
            <key>id</key>
            <string>%bundleid%</string>
            <key>options</key>
            <string>purge_ds_store</string>
            <key>chown</key>
            <array>
              <dict>
                <key>path</key>
                <string>Applications</string>
                <key>user</key>
                <string>root</string>
                <key>group</key>
                <string>admin</string>
              </dict>
            </array>
          </dict>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
