<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of BibDesk.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.BibDesk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BibDesk</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://bibdesk.sourceforge.net/bibdesk.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<!-- Disabled because BibDesk still uses a version 1 signature
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/BibDesk.app</string>
				<key>requirement</key>
				<string>identifier "edu.ucsd.cs.mmccrack.bibdesk" and certificate root = H"893e3d0d906da4c7883ca266b61bde7050790b3b"</string>
			</dict>
		</dict>
		-->
	</array>
</dict>
</plist>
