<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of BibDesk.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.BibDesk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BibDesk</string>
		<key>SPARKLE_FEED_URL</key>
		<string>http://bibdesk.sourceforge.net/bibdesk.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>CHECK_FILESIZE_ONLY</key>
				<true/>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/BibDesk.app</string>
				<key>requirement</key>
				<string>cdhash H"79a83351c728f514b7a6a9ea012a3152fced980e" or cdhash H"4890020f2552f866efc303fa7c47c195cd986de0" or cdhash H"debe535723868d007a295fea5229abee393f9173" or cdhash H"72f0cebfdd966bea47dd3128f08eeba61fcc7297"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
