<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Obsidian and imports into Munki.</string>
    <key>Identifier</key>
    <string>io.github.hjuutilainen.munki.Obsidian</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Obsidian</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Obsidian</string>
        <key>MUNKI_CATEGORY</key>
        <string>Productivity</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>A second brain, for you, forever. Obsidian is a powerful knowledge base that works on top of a local folder of plain text Markdown files.</string>
            <key>developer</key>
            <string>Obsidian</string>
            <key>display_name</key>
            <string>Obsidian</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>ParentRecipe</key>
    <string>io.github.hjuutilainen.download.Obsidian</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
