<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Obsidian and builds a package.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.pkg.Obsidian</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Obsidian</string>
	</dict>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.Obsidian</string>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/Obsidian.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
