<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Vagrant.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Vagrant</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Vagrant</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>HashiCorpURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>project_name</key>
				<string>vagrant</string>
				<key>os</key>
				<string>darwin</string>
				<key>arch</key>
				<string>x86_64</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/vagrant.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Hashicorp, Inc. (D38WU7D763)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
