<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Vault.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Vault</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Vault</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>HashiCorpURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>project_name</key>
				<string>vault</string>
				<key>os</key>
				<string>darwin</string>
				<key>arch</key>
				<string>amd64</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
	        <key>Arguments</key>
	        <dict>
	            <key>archive_path</key>
	            <string>%pathname%</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
	            <key>purge_destination</key>
	            <true/>
	        </dict>
	        <key>Processor</key>
	        <string>Unarchiver</string>
	    </dict>
	    <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/vault</string>
                <key>requirement</key>
                <string>identifier vault and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = D38WU7D763</string>
                <key>strict_verification</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
	</array>
</dict>
</plist>
