<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Vault.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Vault</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Vault</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>HashiCorpURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>project_name</key>
				<string>vault</string>
				<key>os</key>
				<string>darwin</string>
				<key>arch</key>
				<string>amd64</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
