<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of TeamViewer and imports into Munki.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.munki.TeamViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewer</string>
		<key>MAJOR_VERSION</key>
		<string>8</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/TeamViewer</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>All-In-One Solution for Remote Access and Support over the Internet.</string>
			<key>display_name</key>
			<string>TeamViewer</string>
			<key>minimum_os_version</key>
			<string>10.5</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.TeamViewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/payload/root/Applications/TeamViewer %MAJOR_VERSION%</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
		<dict>
		    <key>Comment</key>
		    <string>TeamViewer seems to install in /Applications/TeamViewer %MAJOR_VERSION%/TeamViewer.app so extract accordingly</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/TeamViewerApp.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications/TeamViewer %MAJOR_VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/TeamViewer %MAJOR_VERSION%/TeamViewer.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
