<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of TeamViewerHost and extracts the app information.</string>
        <key>Identifier</key>
        <string>io.github.hjuutilainen.pkg.TeamViewerHost</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>TeamViewerHost</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>io.github.hjuutilainen.download.TeamViewerHost</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%/Install TeamViewerHost.app/Contents/Resources/Install TeamViewerHost.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
                    <key>pkgdirs</key>
                    <dict/>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Comment</key>
                <string>TeamViewer 9 installs in /Applications/TeamViewerHost.app so extract accordingly</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/TeamViewerHostApp.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload/root/Applications/TeamViewerHost.app</string>
                </dict>
                <key>Processor</key>
                <string>PlistReader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpack</string>
                        <string>%RECIPE_CACHE_DIR%/payload</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%/Install TeamViewerHost.app/Contents/Resources/Install TeamViewerHost.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>PkgCopier</string>
            </dict>
        </array>
    </dict>
</plist>
