<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Blender. The only supported architecture is (since v2.72) x86_64.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Blender</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Blender</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Get a link to a redirect page from the official download page</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.blender.org/download/</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://www.blender.org/download/Blender[1-9a-zA-Z\.]+/blender-(?P&lt;version&gt;[1-9a-zA-Z\.]+)-macOS-10\.6\.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Get the page from the previous URLTextSearcher match and find the actual (mirrored) download URL</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://.*/blender-(?P&lt;version&gt;[1-9a-zA-Z\.]+)-macOS-10\.6\.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Blender/blender.app</string>
				<key>requirement</key>
				<string>identifier "org.blenderfoundation.blender" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68UA947AUU"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Blender/blenderplayer.app</string>
				<key>requirement</key>
				<string>identifier "org.blenderfoundation.blenderplayer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68UA947AUU"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
