<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Blender. Set ARCH to either x86_64 or i386, if not defined the default is x86_64.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Blender</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Blender</string>
		<key>ARCH</key>
		<string>x86_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
	    <dict>
	        <key>Processor</key>
	        <string>URLTextSearcher</string>
	        <key>Arguments</key>
	        <dict>
	            <key>url</key>
	            <string>http://www.blender.org/download/</string>
	            <key>re_pattern</key>
                <string>(http://.*/blender-[0-9\.]+[a-z]??-OSX_[0-9\.]+-%ARCH%.zip)</string>
                <key>result_output_var_name</key>
                <string>url</string>
	        </dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
