<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of TextExpander 6.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.TextExpander6</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TextExpander6</string>
		<key>DOWNLOAD_URL</key>
		<string>https://textexpander.com/cgi-bin/redirect.pl?cmd=download&amp;platform=osx</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				 <key>warning_message</key>
				 <string>This recipe has been deprecated and will be removed soon</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
