<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of Citrix Receiver and extracts the pkg</string>
    <key>Identifier</key>
    <string>com.github.cgerke.pkg.CitrixReceiver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CitrixReceiver</string>
		<key>PKG_ID</key>
		<string>com.citrix.receiver.nomas</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.CitrixReceiver</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Install*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/CitrixReceiver.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>